angular.module('starter.services', [])

.factory('Chats', function() {
    // 这里演示创建及获取一组 JSON 数组的方式
    // 创建 chats 数组
    var chats = [{
        id: 0,
        name: 'Ben Sparrow',
        lastText: 'You on your way?',
        face: 'img/ben.png'
    }, {
        id: 1,
        name: 'Max Lynx',
        lastText: 'Hey, it\'s me',
        face: 'img/max.png'
    }, {
        id: 2,
        name: 'Adam Bradleyson',
        lastText: 'I should buy a boat abnhdjj djdj djdjis jsjdkj sjdkjsd ',
        face: 'img/adam.jpg'
    }, {
        id: 3,
        name: 'Perry Governor',
        lastText: 'Look at my mukluks!',
        face: 'img/perry.png'
    }, {
        id: 4,
        name: 'Mike Harrington',
        lastText: 'This is wicked good ice cream.',
        face: 'img/mike.png'
    }, {
        id: 5,
        name: 'Mike Harrington',
        lastText: 'This is wicked good ice cream.',
        face: 'img/mike.png'
    }, {
        id: 6,
        name: 'Mike Harrington',
        lastText: 'This is wicked good ice cream.',
        face: 'img/mike.png'
    }, {
        id: 7,
        name: 'Mike Harrington',
        lastText: 'This is wicked good ice cream.',
        face: 'img/mike.png'
    }, {
        id: 8,
        name: 'Mike Harrington',
        lastText: 'This is wicked good ice cream.',
        face: 'img/mike.png'
    }];

    // 构建 JSON 数组数据返回的例子
    return {
        all: function () {
            return chats;
        },
        remove: function (chat) {
            chats.splice(chats.indexOf(chat), 1);
        },
        get: function (chatId) {
            for (var i = 0; i < chats.length; i++) {
                if (chats[i].id === parseInt(chatId)) {
                    return chats[i];
                }
            }
            return null;
        }
    };
})

.factory('CurrentAffairItems', function () {
    var currentItems = [{
        id: 0,
        title: '00-证监会：上市公司要树立三种意识守住三条底线00',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 1,
        title: '01-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 2,
        title: '02-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 3,
        title: '03-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 4,
        title: '04-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 5,
        title: '05-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 6,
        title: '06-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 7,
        title: '07-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 8,
        title: '08-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }, {
        id: 9,
        title: '09-证监会：上市公司要树立三种意识守住三条底线',
        abstract: '证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。',
        topPicture: 'images/cap001.jpg',
        content: '日前，中国上市公司协会与证监会上市公司监管部联合举办的2016年第8期上市公司董事长、总经理研修班在北京顺利举行。<br/>证监会新闻发言人邓舸在开班致辞中提出，努力提高上市公司质量，是强化上市公司竞争优势，实现转型升级的内在要求，对提升实体经济的整体素质和竞争力、更好地发挥资本市场的资源配置功能具有重大意义。证监会将在刘士余主席“依法监管、从严监管、全面监管”的精神下，着力抓好监管的制度建设，夯实监管基础；抓好信息披露，给投资者一个真实的上市公司；抓好并购重组，进一步深化并购重组市场化改革；抓好公司治理，提高上市公司规范运作水平；抓好退市工作，完善资本市场优胜劣汰的功能，使退市向市场化、法制化和常态化迈进。<br/>他要求上市公司要树立三种意识：对全体股东负责的意识，依法、合规、诚信经营的意识，立足长远持续发展的意识；守住三条底线：坚决守住不进行虚假信息披露的底线、坚决守住不操纵股价和内幕交易的底线、坚决守住不损害上市公司利益的底线。'
    }];

    return {
        all: function () {
            return currentItems;
        },
        remove: function (currentItem) {
            currentItems.splice(currentItems.indexOf(currentItem), 1);
        },
        get: function (currentItemId) {
            for (var i = 0; i < currentItems.length; i++) {
                if (currentItems[i].id === parseInt(currentItemId)) {
                    return currentItems[i];
                }
            }
            return null;
        }
    };

})

.factory('Articles', function ($http) {
    return {
        // 获取全部的电影
        getAll: function () {   
            var promise = $http.get('http://pengcheng.ngrok.cc/api/article/Get').success(function (data) {
                return data;
            });
            return promise
        },

        // 根据电影id获取该影院的上映信息
        getDetail: function (articleID) {
            var getString = 'http://pengcheng.ngrok.cc/api/article/' + articleID;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        },

        // 根据电影id查电影详细信息
        getAllByTypeID: function (movieid) {
            var getString = 'http://pengcheng.ngrok.cc/api/article/movieDetail?movieid=' + movieid;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        }
        ,

        // 根据电影id查上映信息
        getMovieByName: function (movieid) {
            var getString = 'http://pengcheng.ngrok.cc/api/article/movieLaunch?movieid=' + movieid;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        }
    }
})
.factory('Cinema', function ($http) {
    return {
        // 获取全部的申请数据数据

        getAll: function () {
            var promise = $http.get('http://pengcheng.ngrok.cc/api/article/GetCinemaList').success(function (data) {
                return data;
            });
            return promise
        }
        ,
        // 获取指定 id 电影列表
        getDetail: function (cinemaid) {
            var getString = 'http://pengcheng.ngrok.cc/api/article/GetcinemaInfo?cinemaid=' + cinemaid;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        },

        // 获取指定类型 id 所有新闻数据
        getAllByTypeID: function (articleTypeID) {
            var getString = 'http://pengcheng.ngrok.cc/api/Article/GetByTypeID?typeID=' + articleTypeID;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        }

    }
})
.factory('User', function ($http) {
    return {
        // 个人信息

        getAll: function () {
            var promise = $http.get('http://pengcheng.ngrok.cc/api/Account/PostSelectInfo').success(function (data) {
                return data;
            });
            return promise
        }
        ,
        // 获取指定 id 电影列表
        getDetail: function (cinemaid) {
            var getString = 'http://pengcheng.ngrok.cc/api/article/GetcinemaInfo?cinemaid=' + cinemaid;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        },

        // 获取指定类型 id 所有新闻数据
        getAllByTypeID: function (articleTypeID) {
            var getString = 'http://pengcheng.ngrok.cc/api/Article/GetByTypeID?typeID=' + articleTypeID;
            var promise = $http.get(getString).success(function (data) {
                return data;
            });
            return promise
        }

    }
})

